[
    {
        "id": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/cvX6TJV/1.png",
        "review": "The Great Gatsby by F. Scott Fitzgerald is a classic tale set in the 1920s that explores the illusions of the American Dream. Through the eyes of Nick Carraway, readers are drawn into the extravagant world of Jay Gatsby, a mysterious millionaire with a hidden past. As Gatsby's obsession with his lost love, Daisy Buchanan, unfolds, the novel delves into themes of wealth, love, and the corruption of the American Dream. Fitzgerald's prose is both lyrical and evocative, capturing the glamour and decadence of the Jazz Age while also exposing its darker underbelly. With its timeless themes and unforgettable characters, The Great Gatsby remains a must-read for literature enthusiasts.",
        "totalPages": 180,
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Classics","Tragedy"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "id": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/jb52SCj/2.png",
        "review": "1984 by George Orwell is a dystopian masterpiece that paints a grim picture of a totalitarian regime. Set in a world where Big Brother watches your every move, the novel follows Winston Smith, a man who dares to defy the Party. Through Winston's journey, Orwell explores themes of surveillance, censorship, and the power of language. With its haunting portrayal of a society stripped of individuality and freedom, 1984 serves as a chilling warning against the dangers of authoritarianism and the erosion of civil liberties. A thought-provoking read that remains as relevant today as it was when it was first published.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Coming of Age", "Social Justice"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "id": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/N6XxqCY/3.png",
        "review": "To Kill a Mockingbird by Harper Lee is a powerful narrative that tackles themes of racism, justice, and morality. Set in the Deep South during the 1930s, the novel follows Scout Finch, a young girl who witnesses her father, Atticus Finch, defend a black man accused of raping a white woman. Through Scout's innocent eyes, Lee explores the ugliness of prejudice and the beauty of compassion. With its timeless message of empathy and understanding, To Kill a Mockingbird continues to resonate with readers of all ages, reminding us of the importance of standing up for what is right, even in the face of adversity.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Political", "Classic"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "id": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/NWyH4dD/4.png",
        "review": "The Catcher in the Rye by J.D. Salinger is a poignant coming-of-age story that captures the angst and alienation of adolescence. Narrated by the rebellious Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. Through Holden's encounters with various characters, Salinger explores themes of identity, belonging, and the loss of innocence. With its candid portrayal of teenage angst and longing for authenticity, The Catcher in the Rye continues to resonate with readers of all ages, reminding us of the universal struggles of growing up and finding one's place in the world.",
    "totalPages": 224,
        "totalPages": 432,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Romance", "Classic"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "id": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/9Z7jhsJ/5.png",
        "review": "Pride and Prejudice by Jane Austen is a timeless romance that continues to captivate readers with its wit, charm, and memorable characters. Set in the English countryside, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love and society. From her spirited clashes with the proud Mr. Darcy to her sister's tumultuous romantic entanglements, Austen weaves a tale that is as entertaining as it is insightful. With its razor-sharp social commentary and timeless themes of love and marriage, Pride and Prejudice remains a beloved classic that continues to enchant readers of all generations.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming of Age", "American Literature"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "id": 6,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/VVc2bnJ/6.png",
        "review": "Harry Potter and the Philosopher's Stone by J.K. Rowling is a magical journey into a world of wizards, witches, and wonder. Follow young Harry Potter as he discovers his true identity and embarks on a thrilling adventure at Hogwarts School of Witchcraft and Wizardry. From battling trolls to uncovering hidden truths about his past, Harry's journey is filled with excitement, danger, and friendship. With its richly imagined world, compelling characters, and timeless themes of love, courage, and the power of friendship, Harry Potter and the Philosopher's Stone is a captivating read for readers of all ages.",
        "totalPages": 1178,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Epic Fantasy", "Adventure"],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1954
    },
    {
        "id": 7,
        "bookName": "Crime and Punishment",
        "author": "Fyodor Dostoevsky",
        "image": "https://i.ibb.co/Ch0Xgjj/7.png",
        "review": "The Hobbit by J.R.R. Tolkien is a timeless fantasy adventure that takes readers on an epic journey through Middle-earth. Bilbo Baggins, a reluctant hero, embarks on a quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Along the way, he encounters trolls, goblins, elves, and other fantastical creatures, as well as the enigmatic Gollum and the wise wizard Gandalf. Through Bilbo's eyes, readers experience the wonders and perils of Tolkien's richly imagined world, filled with magic, danger, and heroism. With its captivating storytelling, vibrant characters, and epic scope, The Hobbit is a timeless classic that continues to enchant readers of all ages.",
        "totalPages": 551,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Psychological", "Philosophical"],
        "publisher": "The Russian Messenger",
        "yearOfPublishing": 1866
    },
    {
        "id": 8,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/dB33Qj8/8.png",
        "review": "The Da Vinci Code by Dan Brown is a thrilling mystery that combines art, history, and religion into a pulse-pounding adventure. When Harvard symbologist Robert Langdon is called to the Louvre to investigate a murder, he finds himself drawn into a web of intrigue that spans centuries. Teaming up with French cryptologist Sophie Neveu, Langdon follows a trail of clues left by Leonardo da Vinci, uncovering secrets that could shake the foundations of Christianity. With its fast-paced plot, cryptic puzzles, and shocking revelations, The Da Vinci Code keeps readers on the edge of their seats until the very end.",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Adventure", "Middle-earth"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "id": 9,
        "bookName": "The Picture of Dorian Gray",
        "author": "Oscar Wilde",
        "image": "https://i.ibb.co/4fdT5gn/9.png",
        "review": "The Hunger Games by Suzanne Collins is a gripping dystopian novel set in a world where the Capitol reigns supreme and the districts are forced to compete in a brutal annual event known as the Hunger Games. When her sister is chosen as a tribute, Katniss Everdeen volunteers to take her place, thrusting herself into a deadly arena where survival is not guaranteed. Through Katniss's eyes, readers are drawn into a world of oppression, rebellion, and sacrifice. With its thrilling plot, complex characters, and thought-provoking themes, The Hunger Games is a riveting read that leaves a lasting impact.",
        "totalPages": 254,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Gothic Fiction", "Philosophical"],
        "publisher": "Ward, Lock & Co.",
        "yearOfPublishing": 1890
    }
]
